<html><body><table><tr><td>https://baike.baidu.com/item/Python</td><td>Python</td><td>
Python[1] 
（英国发音：/ˈpaɪθən/ 美国发音：/ˈpaɪθɑːn/）, 是一种面向对象的解释型计算机程序设计语言，由荷兰人Guido van Rossum于1989年发明，第一个公开发行版发行于1991年。Python是纯粹的自由软件， 源代码和解释器CPython遵循 GPL(GNU General Public License)协议。Python语法简洁清晰，特色之一是强制用空白符(white space)作为语句缩进。Python具有丰富和强大的库。它常被昵称为胶水语言，能够把用其他语言制作的各种模块（尤其是C/C++）很轻松地联结在一起。常见的一种应用情形是，使用Python快速生成程序的原型（有时甚至是程序的最终界面），然后对其中有特别要求的部分，用更合适的语言改写，比如3D游戏中的图形渲染模块，性能要求特别高，就可以用C/C++重写，而后封装为Python可以调用的扩展类库。需要注意的是在您使用扩展类库时可能需要考虑平台问题，某些可能不提供跨平台的实现。7月20日，IEEE发布2017年编程语言排行榜：Python高居首位[2] 
。
</td></tr><tr><td>https://baike.baidu.com/item/BitTorrent</td><td>BitTorrent</td><td>
比特流（BitTorrent）是一种内容分发协议，由布拉姆·科恩自主开发。它采用高效的软件分发系统和点对点技术共享大体积文件（如一部电影或电视节目），并使每个用户像网络重新分配结点那样提供上传服务。一般的下载服务器为每一个发出下载请求的用户提供下载服务，而BitTorrent的工作方式与之不同。分配器或文件的持有者将文件发送给其中一名用户，再由这名用户转发给其它用户，用户之间相互转发自己所拥有的文件部分，直到每个用户的下载都全部完成。这种方法可以使下载服务器同时处理多个大体积文件的下载请求，而无须占用大量带宽。
</td></tr><tr><td>https://baike.baidu.com/item/GNU</td><td>gnu</td><td>
GNU计划，又称革奴计划，是由Richard Stallman在1983年9月27日公开发起的。它的目标是创建一套完全自由的操作系统。Richard Stallman最早是在net.unix-wizards新闻组上公布该消息，并附带《GNU宣言》等解释为何发起该计划的文章，其中一个理由就是要“重现当年软件界合作互助的团结精神”。为保证GNU软件可以自由地“使用、复制、修改和发布”，所有GNU软件都有一份在禁止其他人添加任何限制的情况下授权所有权利给任何人的协议条款，GNU通用公共许可证（GNU General Public License，GPL）。即“反版权”（或称Copyleft）概念。
</td></tr><tr><td>https://baike.baidu.com/item/卡耐基梅隆大学</td><td>卡内基·梅隆大学</td><td>
美国卡耐基梅隆大学（Carnegie Mellon University），简称CMU，坐落在美国宾夕法尼亚州的匹兹堡(Pittsburgh)，是一所拥有13,600名在校学生和1,423名教职及科研人员的世界著名学府。该校拥有享誉全球的计算机学院和戏剧学院，其艺术学院，商学院，工程院以及公共管理学院等也都在全美名列前茅。CMU由工业家兼慈善家安德鲁·卡耐基于1900年创建，当时名为卡内基技术学校，1912年改名为卡耐基梅隆大学，开始向以研究为主的美国重点大学转变。[1] 
其在2016-17泰晤士高等教育全球大学排名中位列世界第23[2] 
，包括工程与技术排名世界第15，商业与经济排名世界第16，计算机排名世界第6，全美大学排名第16[3] 
。在2017年QS世界大学排名中，其计算机与信息系统学排名世界第3，统计与运筹排名第9，电子工程排名第23，数学第25。[4] 
在2017年USNews美国大学排名中，卡耐基梅隆大学位列24名，包括最佳创新大学第6位，商科全美第6，工程院第8（本科）/ 5（研究生），计算机学院第1，统计学第9，离散及组合数学第11。[5] 
卡耐基梅隆的戏剧学院也享有盛誉，在2016年被好莱坞记者报排在全美第3。[6] 
截至2017年卡耐基梅隆大学共培养出了12个图灵奖，20个诺贝尔奖，9个奥斯卡，114个艾米奖，44个托尼奖。[7] 
除了匹兹堡校区，卡耐基梅隆大学在美国硅谷以及卡塔尔设有分校，并且其在世界各地均设有合作研究机构，包括纽约，洛杉矶，华盛顿特区，中国，澳大利亚，葡萄牙，卢旺达等。[8] 

</td></tr><tr><td>https://baike.baidu.com/item/Web/150564</td><td>web</td><td>
web（World Wide Web）即全球广域网，也称为万维网，它是一种基于超文本和HTTP的、全球性的、动态交互的、跨平台的分布式图形信息系统。是建立在Internet上的一种网络服务，为浏览者在Internet上查找和浏览信息提供了图形化的、易于访问的直观界面，其中的文档及超级链接将Internet上的信息节点组织成一个互为关联的网状结构。[1] 

</td></tr></table></body></html>